<a href="https://colab.research.google.com/github/beginAtharun/FML/blob/main/PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
pip install pandas

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: pandas in /usr/local/lib/python3.9/dist-packages (1.3.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.9/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.9/dist-packages (from pandas) (2022.7.1)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/lib/python3.9/dist-packages (from pandas) (1.22.4)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.9/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
#To check th e instalation
import pandas as pd

#shorthand identifier name can be anything

DATA  ANALYSIS

As said that pandas used for data analysis 
          pandas will convert raw data created by using numpy   arrays and lists into Sereis and those series into DataFrames 
          these data frames can be analysed

arrays or list-->Series--->Dataframmes

Pandas Series


    it is like a one-dimension array


EXAMPLE-->

In [ ]:
import pandas as pd

#creating a list of values
arr = [4,6,3,1]
my_series=pd.Series(arr)
#Converting them into a single column values

print(my_series)

0    4
1    6
2    3
3    1
dtype: int64

So in pandas SERIES sre uses to convert a list of values into column
 values( i.e.. Series sre used represent column values)

In [ ]:
#As that these series are indexed as based on row indexes

print(my_series[2])

3

LABELING
  
  ---- In pandas we can change the row indexes by giving our own labels(INDEX)

In [ ]:
#WE should use index argument to set own indexes to the rows of the series our column
#default row index are 0,1,2,3,4...
index1=[1,2,3,4]
index2=['a','b','c','d']
my_series1=pd.Series(arr, index=index1)
my_series2=pd.Series(arr,index=index2)
print(my_series1)
print(my_series2)

1    4
2    6
3    3
4    1
dtype: int64
a    4
b    6
c    3
d    1
dtype: int64

PANDAS DATAFRAMES
    
    in Pandas we can  analyse the data which were in the multi-dimension tabels

     Difference between SERIES and DATAFRAMES
         SERIES IS LIKE COLUMNS( consist of column values)
         DATAFRAMES IS LIKE WHOLE TABLE( consist of column names along with colummn values( i.e.Series))

In [ ]:
#We can create a data frame by using Pyhton Dictionary
import pandas as pd
#Creating a raw data
data={
    "Cars":["Bmw","Ford","Benz"],
    "Price":[256, 356, 400]
}
#Converting this data into DATAFRAME
my_dataframe=pd.DataFrame(data)
print(my_dataframe)

   Cars  Price
0   Bmw    256
1  Ford    356
2  Benz    400

In [ ]:
#NOT ONLY BY USING DICTIONARIES THERE ARE MANY OTHER WAYS TO COLLECT DATA
vehicle=[["Bmw",200],["ford",300],["benz",400]]

#data was collected now to set column index or column names to this data by COLUMNS ARGUMENT
my_df=pd.DataFrame(vehicle,columns=['Cars','Price'])

#default column indexes are 0,1,2,3,4......
print(my_df)

   Cars  Price
0   Bmw    200
1  ford    300
2  benz    400

In [ ]:
my_df.describe()

       Price
count    3.0
mean   300.0
std    100.0
min    200.0
25%    250.0
50%    300.0
75%    350.0
max    400.0

IF YOU WANT TO DISPLAY SOME PART OF INFORMATION IN THE ENTIRE DATASET (or) DATAFRAME

    Done by loc[...] method

    there are three ways to performe it..

    1st-->
      to display all cloumns within a specific row range
        syntax--->dataframe_name.loc[row_start_index:row_end_index]
        this will print from information of dataframe form index row_start to row_end-1
    2nd-->
      to display specific column values within specific row range
      syntax--->dataframe_name.loc[startindex:end_index,[col1,col2..]]
    3rd-->
      to display specific rows or combination of rows and colummns
      dataframe_name.loc[[row1,row2...]]
             or
      dataframe_name.loc[[row1,row2..],[col1,col2,clo3...]]
Finally we can say that loc method is used to display certain rows over
a specific colummns

In [ ]:
print(my_df)
print("------------")
print(my_df.loc[0:1])
print("----------")
print(my_df.loc[0:2,['Cars']])
print("-----------")
print(my_df.loc[[0,2],['Cars','Price']])

   Cars  Price
0   Bmw    200
1  ford    300
2  benz    400
------------
   Cars  Price
0   Bmw    200
1  ford    300
----------
   Cars
0   Bmw
1  ford
2  benz
-----------
   Cars  Price
0   Bmw    200
2  benz    400

MERGING
    
  ------>Merging of two dataframes is done by si,ilar columns
  
  ----->Merging is nothing but intersection of two data frames based on smilar columns

EXAMPLE-->

In [ ]:
import pandas as pd
data1={
    'car_name_high':["BMW","FORD","BENZ"],
    'price':[200,300,400]
}
data2={
    'car_name_low':["Maruthi","Shift","Hayundai"],
    'price':[100,300,400]
}
my_dt1=pd.DataFrame(data1)
my_dt2=pd.DataFrame(data2)
print(my_dt1)
print("___________________________")
print(my_dt2)
print("___________________________")
my_dt=pd.merge(my_dt1,my_dt2,on="price")
print(my_dt)

  car_name_high  price
0           BMW    200
1          FORD    300
2          BENZ    400
___________________________
  car_name_low  price
0      Maruthi    100
1        Shift    300
2     Hayundai    400
___________________________
  car_name_high  price car_name_low
0          FORD    300        Shift
1          BENZ    400     Hayundai

GROUPING
   
    it is done by 'groupby()' method 
    it is used to retrive the groups from a dataframe on certain colummna based on their values

EXAMPLE--->

In [ ]:
data3={
    'cars':['bmw','ford','benz','shift','hundayi','leapord'],
    'price':[100,200,300,300,300,400]
}
my_data3=pd.DataFrame(data3)
print(my_data3)

      cars  price
0      bmw    100
1     ford    200
2     benz    300
3    shift    300
4  hundayi    300
5  leapord    400

In [ ]:
req_price=my_data3.groupby('price')
print(req_price.get_group(300))

      cars  price
2     benz    300
3    shift    300
4  hundayi    300

CONCATING

     It is nothing but joining (or) conatination of two dataframes

In [ ]:
df3={
    'car_names':["bmw","ford","benz"],
     'price':[100,200,300]
}
df4={
    'car_names':["maruthi","hundayi",'shift'],
     'price':[300,400,500]
}
my_df3=pd.DataFrame(df3)
my_df4=pd.DataFrame(df4)
print(pd.concat([my_df3,my_df4]))
print("---------------------------")
print(pd.concat([my_df3,my_df4],axis=1))

  car_names  price
0       bmw    100
1      ford    200
2      benz    300
0   maruthi    300
1   hundayi    400
2     shift    500
---------------------------
  car_names  price car_names  price
0       bmw    100   maruthi    300
1      ford    200   hundayi    400
2      benz    300     shift    500

In [ ]:
#Consider data1 and data2 datas
total=pd.concat([my_dt1,my_dt2])
print(total)

  car_name_high  price car_name_low
0           BMW    200          NaN
1          FORD    300          NaN
2          BENZ    400          NaN
0           NaN    100      Maruthi
1           NaN    300        Shift
2           NaN    400     Hayundai

In [ ]:
#TO READ A CSV FILE WHICH CONSIST OF A DATA IN THE FORMATE OF DATASET
data4=pd.read_csv("/content/cars.csv")
print(data4)

     age  gender  miles   debt  income  sales
0     28       0     23      0    4099    620
1     26       0     27      0    2677   1792
2     30       1     58  41576    6215  27754
3     26       1     25  43172    7626  28256
4     20       1     17   6979    8071   4438
..   ...     ...    ...    ...     ...    ...
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104

[963 rows x 6 columns]

In [ ]:
#head() method
print(data4.head())
print("<<<<<----------------------------------------------------------------------------->>>>>")
print(data4.head(10))

   age  gender  miles   debt  income  sales
0   28       0     23      0    4099    620
1   26       0     27      0    2677   1792
2   30       1     58  41576    6215  27754
3   26       1     25  43172    7626  28256
4   20       1     17   6979    8071   4438
<<<<<----------------------------------------------------------------------------->>>>>
   age  gender  miles   debt  income  sales
0   28       0     23      0    4099    620
1   26       0     27      0    2677   1792
2   30       1     58  41576    6215  27754
3   26       1     25  43172    7626  28256
4   20       1     17   6979    8071   4438
5   58       1     18      0    1262   2102
6   44       1     17    418    7017   8520
7   39       1     28      0    3282    500
8   44       0     24  48724    9980  22997
9   46       1     46  57827    8163  26517

In [ ]:
#tail() method
print(data4.tail())
print("<<<<<----------------------------------------------------------------------------->>>>>")
print(data4.tail(10))

     age  gender  miles   debt  income  sales
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104
<<<<<----------------------------------------------------------------------------->>>>>
     age  gender  miles   debt  income  sales
953   44       1     18   8989    4249   5947
954   58       0     17   6493    7095  12830
955   53       0     23   3574    2189   5888
956   58       0     23   5842    6019   9130
957   36       0     27   7133   11292  18062
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104

In [ ]:
#Retriving of values
data4['age']

0      28
1      26
2      30
3      26
4      20
       ..
958    22
959    19
960    28
961    50
962    47
Name: age, Length: 963, dtype: int64

In [ ]:
data4.loc[0:5,['age','gender']]

   age  gender
0   28       0
1   26       0
2   30       1
3   26       1
4   20       1
5   58       1

DATA CLEANING

REMOVING OF USELESS DATA
    
    ----- EMPTY CELLS
    -----WRONG DATA
    -----DUPLICATE DATA

1.)HOW TO CLEAN EMPTY CELLS
  
    ----BY REMOVING
    ----BY REPLACING

In [ ]:
#Consider a small data frame
total

  car_name_high  price car_name_low
0           BMW    200          NaN
1          FORD    300          NaN
2          BENZ    400          NaN
0           NaN    100      Maruthi
1           NaN    300        Shift
2           NaN    400     Hayundai

REMOVING OF ROWS------>EXAMPLE

In [ ]:
new_df=total.dropna()
print(new_df)
#CREATES A NEW DATA FRAME

Empty DataFrame
Columns: [car_name_high, price, car_name_low]
Index: []

In [ ]:
#In order to clean in same data frame
#inplace argument with True as value
total.dropna(inplace=True)
print(total)

Empty DataFrame
Columns: [car_name_high, price, car_name_low]
Index: []

In [ ]:
total=pd.concat([my_dt1,my_dt2])
print(total)

  car_name_high  price car_name_low
0           BMW    200          NaN
1          FORD    300          NaN
2          BENZ    400          NaN
0           NaN    100      Maruthi
1           NaN    300        Shift
2           NaN    400     Hayundai

REPLACING OF EMPTY CELLLS

In [ ]:
#It is not required to remove the entire row
total.fillna("car",inplace=True)
print(total)
#syntax--->dataframe_name.fillna(value,inplace=True)

  car_name_high  price car_name_low
0           BMW    200          car
1          FORD    300          car
2          BENZ    400          car
0           car    100      Maruthi
1           car    300        Shift
2           car    400     Hayundai

2.)HOW TO CLEAN WRONG DATA
 
 ---------Wrong data means having a value instead of another value
 
 ---------by replacing that wrong value data can be cleaned

 --------- by  row index (or) row name and column index (or) column name

In [ ]:
total.loc[0,'car_name_high']="FERARI"
total

  car_name_high  price car_name_low
0        FERARI    200          car
1          FORD    300          car
2          BENZ    400          car
0        FERARI    100      Maruthi
1           car    300        Shift
2           car    400     Hayundai

3.) HOW TO  REMOVE DUPLICATES FROM THE DATAFRAME

In [ ]:
#drop_duplicates() method is used to remove duplicates
total.drop_duplicates(inplace=True)
total
#SYNTAX----->dataframe_name.drop_duplicates(inplace=True)

  car_name_high  price car_name_low
0        FERARI    200          car
1          FORD    300          car
2          BENZ    400          car
0        FERARI    100      Maruthi
1           car    300        Shift
2           car    400     Hayundai

In [ ]:
# to know the information on the structure of dataframe
#Lets consider cars dataframe
data4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 963 entries, 0 to 962
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     963 non-null    int64
 1   gender  963 non-null    int64
 2   miles   963 non-null    int64
 3   debt    963 non-null    int64
 4   income  963 non-null    int64
 5   sales   963 non-null    int64
dtypes: int64(6)
memory usage: 45.3 KB

AS IT IS USED TO TELL

----------COLUMN NAMES

----------DATATYPES OF THE COLUMNS

----------DOES THE COLUMN HAVE ANY NULL  VALUES

In [ ]:
print("                                               ##################################COMPLETED########################################")
print("                                               ##################################THANK YOU########################################")